Revit 2027 API
RebarInSystem.SystemId Property
 The Id of an AreaReinforcement or PathReinforcement element that owns this element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SystemId { get; }
Public ReadOnly Property SystemId As ElementId
	Get
public:
property ElementId^ SystemId {
	ElementId^ get ();
}
member SystemId : ElementId with get
Property Value
ElementId
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace